Процедура ВыполнитьАутентификацию(Логин) Экспорт    
	Соединение = Новый HTTPСоединение("192.168.1.4",,"MobileClient");
	Запрос = Новый HTTPЗапрос("nogtevoy/hs/users/getUser?username="+Логин);
	Ответ = Соединение.Получить(Запрос);    
	Если Ответ.КодСостояния = 200 Тогда
	    МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
	    Если МассивДанныхПользователя.Количество() = 0 Тогда
	        Сообщить("По логину " + Логин +" пользователь не найден!");
	    ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
	        АвторизоватьПользователя(МассивДанныхПользователя[0]);
	    КонецЕсли;
	Иначе
	    Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;    
КонецПроцедуры     

Процедура Разлогиниться() Экспорт
    Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
        ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
    КонецЕсли;
КонецПроцедуры                        

Процедура ВыполнитьРегистрацию(Логин,НомерТелефона) Экспорт    
	Соединение = Новый HTTPСоединение("192.168.1.4",,"MobileClient");
	Запрос = Новый HTTPЗапрос("nogtevoy/hs/users/createUser?username="+Логин+"&phone_number="+НомерТелефона);
	Ответ = Соединение.Получить(Запрос); 
	
	Если Ответ.КодСостояния = 200 Тогда
		МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		Если МассивДанныхПользователя.Количество() = 0 Тогда 
			Сообщить("По логину " + Логин +" пользователь не создан!");
		Иначе 
			АвторизоватьПользователя(МассивданныхПользователя[0]);
		КонецЕсли;
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;    
КонецПроцедуры 

Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт   
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя.name;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();
    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя.name);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользователь.ВнешнийGUID = ДанныеПользователя.code;  
        НовыйПользователь.Наименование = ДанныеПользователя.name;
        НовыйПользователь.Записать(); 
        ТекущийПользователь = НовыйПользователь.Ссылка; 
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;       
КонецПроцедуры
